## Hierarchical Indexing / Multi Indexing
* Enables us to have multiple index level on axis. 
* Allows to work with higher dimensional data in lower dimensional form. Meaning we can represent higher dimensional data in familiar 1D or 2D structure.

In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series(np.random.randn(9), index = [['a','a','a','b','b','c','c','d','d'], [1,2,3,1,3,1,2,2,3]])

In [3]:
s1

a  1    1.391271
   2    0.299874
   3   -1.401987
b  1    0.990189
   3   -2.000483
c  1    1.060146
   2    1.060553
d  2    0.649553
   3   -0.195554
dtype: float64

In [4]:
s1.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [5]:
s1['b']

1    0.990189
3   -2.000483
dtype: float64

In [6]:
s1['b':'c']

b  1    0.990189
   3   -2.000483
c  1    1.060146
   2    1.060553
dtype: float64

In [7]:
s1.loc[['b', 'c']]

b  1    0.990189
   3   -2.000483
c  1    1.060146
   2    1.060553
dtype: float64

In [8]:
s1.loc[:, 2] # inner level selection

a    0.299874
c    1.060553
d    0.649553
dtype: float64

In [9]:
s1.unstack() # rearrange data in dataFrame

          1         2         3
a  1.391271  0.299874 -1.401987
b  0.990189       NaN -2.000483
c  1.060146  1.060553       NaN
d       NaN  0.649553 -0.195554

In [10]:
s1.unstack().stack()

a  1    1.391271
   2    0.299874
   3   -1.401987
b  1    0.990189
   3   -2.000483
c  1    1.060146
   2    1.060553
d  2    0.649553
   3   -0.195554
dtype: float64

In [11]:
d1 = pd.DataFrame(np.arange(12).reshape((4,3)), index = [['a','a','b','b'], [1,2,1,2]], 
                  columns=[['ohio', 'ohio', 'colorado'], ['green','red','green']])

In [12]:
d1

     ohio     colorado
    green red    green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [13]:
d1.index.names

FrozenList([None, None])

In [14]:
d1.index.names = ['key1', 'key2']

In [15]:
d1.columns.names = ['state', 'color']

In [16]:
d1

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [17]:
d1['ohio']

color      green  red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### `swaplevel`
* Takes two level numbers or names and returns a new object with the levels interchanged

In [18]:
d1.swaplevel('key1', 'key2')

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

### `sort_index`
* Sorts the data using values in a single index

In [19]:
d1.sort_index(level='key2')

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [20]:
d1.swaplevel(0,1).sort_index(level=0)

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

* Data selection performance is much better when object is sorted in such way.

In [21]:
d1

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [22]:
d1.sum(level = 'key2')

state  ohio     colorado
color green red    green
key2
1         6   8       10
2        12  14       16

In [23]:
d1.sum(level = 'color', axis = 1)

color      green  red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### `set_index`
* Create new dataframe one or more its column as index

In [24]:
d2 = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),'c': ['one', 'one', 'one', 'two', 'two','two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})

In [25]:
d2

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [26]:
d2.set_index(['c', 'd'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

* Column will be removed by default, to keep it use `drop = False`

In [27]:
d2.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

### `reset_index`
* opposite of `set_index`
* hierarchical index levels are moved into the columns

In [28]:
d2.reset_index()

   index  a  b    c  d
0      0  0  7  one  0
1      1  1  6  one  1
2      2  2  5  one  2
3      3  3  4  two  0
4      4  4  3  two  1
5      5  5  2  two  2
6      6  6  1  two  3

#### Example

In [29]:
index = [('California', 2000), ('California', 2010), ('New York', 2000), ('New York', 2010), 
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648,37253956,18976457,19378101,208518210,25145561]

In [30]:
pop = pd.Series(populations, index=index)

In [31]:
pop

(California, 2000)     33871648
(California, 2010)     37253956
(New York, 2000)       18976457
(New York, 2010)       19378101
(Texas, 2000)         208518210
(Texas, 2010)          25145561
dtype: int64

In [32]:
pop[('California', 2010)]

37253956

* Lets get all state population for year 2010

In [33]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378101
(Texas, 2010)         25145561
dtype: int64

* Convert it to multiindex

In [34]:
index = pd.MultiIndex.from_tuples(pop.index)

In [35]:
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [36]:
pop = pop.reindex(index)

In [37]:
pop

California  2000     33871648
            2010     37253956
New York    2000     18976457
            2010     19378101
Texas       2000    208518210
            2010     25145561
dtype: int64

In [38]:
pop[:, 2010]

California    37253956
New York      19378101
Texas         25145561
dtype: int64

In [39]:
pop.unstack()

                 2000      2010
California   33871648  37253956
New York     18976457  19378101
Texas       208518210  25145561

* Extra level of multi index represents an extra dimension of data
* Lets add another column of under_18 population

In [40]:
pop = pd.DataFrame({'total': pop, 'under_18': [34553,34,65824,456,685,23542]})

In [41]:
pop

                     total  under_18
California 2000   33871648     34553
           2010   37253956        34
New York   2000   18976457     65824
           2010   19378101       456
Texas      2000  208518210       685
           2010   25145561     23542

* Fraction of people under 18 by year

In [42]:
pop['under_18'] / pop['total']

California  2000    1.020116e-03
            2010    9.126548e-07
New York    2000    3.468719e-03
            2010    2.353172e-05
Texas       2000    3.285085e-06
            2010    9.362289e-04
dtype: float64

### Explicit multiindex constructor

In [43]:
pd.MultiIndex.from_arrays([['a','a','b','b'], [1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [44]:
pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [45]:
pd.MultiIndex.from_product([['a', 'b'], [1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [46]:
pd.MultiIndex(levels = [['a', 'b'], [1,2]], labels = [[0,0,1,1], [0,1,0,1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

* We can pass this objects as the index argument when creating a series or data frame or to the reindex method of an existing Series or DataFrame.

In [47]:
pop

                     total  under_18
California 2000   33871648     34553
           2010   37253956        34
New York   2000   18976457     65824
           2010   19378101       456
Texas      2000  208518210       685
           2010   25145561     23542

In [48]:
pop.index.names = ['state', 'year']

In [49]:
pop

                     total  under_18
state      year
California 2000   33871648     34553
           2010   37253956        34
New York   2000   18976457     65824
           2010   19378101       456
Texas      2000  208518210       685
           2010   25145561     23542

* Both rows and columns can have multiindex

In [50]:
index = pd.MultiIndex.from_product([[2013,2014], [1,2]], names = ['year', 'visit'])
column = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'],['HR', 'Temp']], names=['subject', 'type'])

In [51]:
index

MultiIndex(levels=[[2013, 2014], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['year', 'visit'])

In [52]:
column

MultiIndex(levels=[['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['subject', 'type'])

In [53]:
data = np.round(np.random.randn(4,6), 1)

In [54]:
data

array([[-0.7,  1.2, -0.9, -0.1, -1.4, -1. ],
       [-0.2,  0.8,  0.8, -0.7,  1.4, -0.1],
       [-0.3,  0. ,  2.4,  0.5,  1. ,  0.3],
       [ 0.3,  2. , -0.3, -0.1,  0.2, -0.1]])

In [55]:
data[:, ::2] *= 10

In [56]:
data += 37

In [57]:
data

array([[30. , 38.2, 28. , 36.9, 23. , 36. ],
       [35. , 37.8, 45. , 36.3, 51. , 36.9],
       [34. , 37. , 61. , 37.5, 47. , 37.3],
       [40. , 39. , 34. , 36.9, 39. , 36.9]])

In [58]:
health_data = pd.DataFrame(data, index=index, columns=column)

In [59]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      30.0  38.2  28.0  36.9  23.0  36.0
     2      35.0  37.8  45.0  36.3  51.0  36.9
2014 1      34.0  37.0  61.0  37.5  47.0  37.3
     2      40.0  39.0  34.0  36.9  39.0  36.9

In [60]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      28.0  36.9
     2      45.0  36.3
2014 1      61.0  37.5
     2      34.0  36.9

In [61]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      30.0  38.2  28.0  36.9  23.0  36.0
     2      35.0  37.8  45.0  36.3  51.0  36.9
2014 1      34.0  37.0  61.0  37.5  47.0  37.3
     2      40.0  39.0  34.0  36.9  39.0  36.9

In [62]:
health_data['Guido', 'HR']

year  visit
2013  1        28.0
      2        45.0
2014  1        61.0
      2        34.0
Name: (Guido, HR), dtype: float64

In [63]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      30.0  38.2
     2      35.0  37.8

In [64]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        30.0
      2        35.0
2014  1        34.0
      2        40.0
Name: (Bob, HR), dtype: float64

In [65]:
idx = pd.IndexSlice

In [66]:
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      30.0  28.0  23.0
2014 1      34.0  61.0  47.0

In [67]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      30.0  38.2  28.0  36.9  23.0  36.0
     2      35.0  37.8  45.0  36.3  51.0  36.9
2014 1      34.0  37.0  61.0  37.5  47.0  37.3
     2      40.0  39.0  34.0  36.9  39.0  36.9

* Find average measurement of two visit each year

In [68]:
health_data.mean(level= 'year')

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR   Temp
year
2013     32.5  38.0  36.5  36.6  37.0  36.45
2014     37.0  38.0  47.5  37.2  43.0  37.10

* `pd.Panel` is 3D data/ `pd.Panel4D` is 4D data.

# Combining and merging datasets

* `pd.merge`: Connects rows in data frames based on one or more keys. Like SQL join
* `pd.concat`: stacks together objects along the axis
* `combine_first`: Splicing together overlapping data to fill in missing values in one object with values from another.

* Combine datasets by linking rows using 1 or more keys.

#### one to one join

In [69]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [70]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [71]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [72]:
df3 = pd.merge(df1,df2)

In [73]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### many to one join

In [74]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})

In [75]:
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

#### many to many join

In [76]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux','spreadsheets', 'organization']})

In [77]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [78]:
df1 = df1.set_index('employee')

In [79]:
df1

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [80]:
df2 = df2.set_index('employee')

In [81]:
df2

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [82]:
pd.merge(df1, df2, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

* `join` operation defaults to joining on index

In [83]:
df1.join(df2)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [84]:
d3 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})

In [30]:
d4 = pd.DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})

In [31]:
d3

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [32]:
d4

  key  data2
0   a      0
1   b      1
2   d      2

In [33]:
pd.merge(d3, d4)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

* I did not specify about column to join on. So pandas uses overlapping column name as the keys

In [34]:
pd.merge(d3, d4, on='key') # explicit specification of column name

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

* If column name are separate then specify as,

In [35]:
d5 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
d6 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [36]:
d5

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [37]:
d6

  rkey  data2
0    a      0
1    b      1
2    d      2

In [38]:
pd.merge(d5,d6, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

* By default merge do `inner` join, keys in result are intersection of common set found in both tables.
* Other joins are 
* `left` : join all key combination found in left table.
* `right` : Use all key combinations found in right table
* `outer` :  takes union of the keys combining effect of applying both right and left join.

In [39]:
pd.merge(d3,d4, how = 'outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [42]:
d7 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
d8 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'], 'data2': range(5)})

In [43]:
d7

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [44]:
d8

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [45]:
pd.merge(d7, d8, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

* many to many joins form the cartesian product of the rows. There were 3 'b' rows in dataframe and 2 in the right one, there are 6 'b' rows in the result.

In [46]:
pd.merge(d7, d8, on='key', how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [47]:
pd.merge(d7, d8, on='key', how='right')

   key  data1  data2
0    b    0.0      1
1    b    1.0      1
2    b    5.0      1
3    b    0.0      3
4    b    1.0      3
5    b    5.0      3
6    a    2.0      0
7    a    4.0      0
8    a    2.0      2
9    a    4.0      2
10   d    NaN      4

### Merge with multiple keys

In [52]:
d9 = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],'key2': ['one', 'two', 'one'], 'lval': [1, 2, 3]})
d10 = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'], 'key2': ['one', 'one', 'one', 'two'], 'rval': [4, 5, 6, 7]})

In [53]:
d9

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [54]:
d10

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [56]:
pd.merge(d9, d10, on = ['key1', 'key2'], how = 'outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

* Think multiple keys as forming an  array of tuples to be used as single join key.

#### Overlapping Column name
* using renaming axis we can do it
* `merge` has `suffixes` option to deal with it.

In [57]:
pd.merge(d9, d10, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [58]:
pd.merge(d9,d10, on='key2', suffixes=('_d9', '_d10'))

  key1_d9 key2  lval key1_d10  rval
0     foo  one     1      foo     4
1     foo  one     1      foo     5
2     foo  one     1      bar     6
3     bar  one     3      foo     4
4     bar  one     3      foo     5
5     bar  one     3      bar     6
6     foo  two     2      bar     7

![merge_argument](images/merge_arguments.jpg)

### Merging on Index
* `left_index = True` or `right_index = TRUE` or both can be used to mention that merge keys are in index.

In [59]:
d11 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 'value' : range(6)})

In [61]:
d12 = pd.DataFrame({'group_val':[3.5,7]}, index = ['a', 'b'])

In [62]:
d11

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [63]:
d12

   group_val
a        3.5
b        7.0

In [64]:
pd.merge(d11, d12, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [65]:
pd.merge(d11,d12, left_on='key', right_index=True, how= 'outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [61]:
d13 = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio','Nevada', 'Nevada'],'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})
d14 = pd.DataFrame(np.arange(12).reshape((6, 2)),index=[['Nevada', 'Nevada', 'Ohio', 'Ohio','Ohio', 'Ohio'],
                                                        [2001, 2000, 2000, 2000, 2001, 2002]],columns=['event1', 'event2'])

In [67]:
d13

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [68]:
d14

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [69]:
pd.merge(d13, d14, left_on=['key1', 'key2'], right_index = True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [70]:
pd.merge(d13, d14, left_on = ['key1', 'key2'], right_index=True, how = 'outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [83]:
d15 = pd.DataFrame(np.arange(1.,7.).reshape((3,2)), index = ['a', 'c', 'e'], columns = ['Ohio', 'Nevada'])

In [84]:
d15

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [85]:
d16 = pd.DataFrame(np.arange(7., 15.).reshape(4,2), index = ['b', 'c', 'd', 'e'], columns=['Missori', 'Alabama'])

In [86]:
d16

   Missori  Alabama
b      7.0      8.0
c      9.0     10.0
d     11.0     12.0
e     13.0     14.0

In [87]:
pd.merge(d15, d16, left_index=True, right_index=True, how='outer')

   Ohio  Nevada  Missori  Alabama
a   1.0     2.0      NaN      NaN
b   NaN     NaN      7.0      8.0
c   3.0     4.0      9.0     10.0
d   NaN     NaN     11.0     12.0
e   5.0     6.0     13.0     14.0

### `join`
* Dataframe has join method for merging by index. It can also be used to combine together many dataframes having the same or similar index but non overlapping columns
* It performs left join by default

In [88]:
d15.join(d16, how='outer')

   Ohio  Nevada  Missori  Alabama
a   1.0     2.0      NaN      NaN
b   NaN     NaN      7.0      8.0
c   3.0     4.0      9.0     10.0
d   NaN     NaN     11.0     12.0
e   5.0     6.0     13.0     14.0

* Even we can join the indexed of passed dataframe on one of the columns of calling dataframe using `on` parameter.

In [89]:
d17 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]], 
                   index=['a', 'c', 'e', 'f'], columns=['New York', 'Oregon'])

In [90]:
d16

   Missori  Alabama
b      7.0      8.0
c      9.0     10.0
d     11.0     12.0
e     13.0     14.0

In [91]:
d15.join([d16,d17])

   Ohio  Nevada  Missori  Alabama  New York  Oregon
a   1.0     2.0      NaN      NaN       7.0     8.0
c   3.0     4.0      9.0     10.0       9.0    10.0
e   5.0     6.0     13.0     14.0      11.0    12.0

## Concatenating along an axis
* binding, stacking
* `concatenate` function of numpy does similar

In [92]:
a1 = np.arange(12).reshape((3,4))

In [93]:
a1

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [94]:
np.concatenate([a1,a1], axis = 1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

* `concat`

In [97]:
s2 = pd.Series([0,1], index = ['a', 'b'])

In [98]:
s3 = pd.Series([2,3,4], index = ['c', 'd', 'e'])

In [99]:
s4 = pd.Series([5,6], index = ['f', 'g'])

In [101]:
s2

a    0
b    1
dtype: int64

In [102]:
s3

c    2
d    3
e    4
dtype: int64

In [103]:
s4

f    5
g    6
dtype: int64

In [105]:
pd.concat([s2,s3, s4])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

* By default it works along axis 0

In [106]:
pd.concat([s2,s3,s4], axis = 1)

C:\Users\davep\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [107]:
s5 = pd.concat([s2,s4])

In [108]:
s5

a    0
b    1
f    5
g    6
dtype: int64

In [110]:
pd.concat([s2, s5], axis=1)

C:\Users\davep\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [111]:
pd.concat([s2, s5], axis=1, join='inner')

   0  1
a  0  0
b  1  1

* Even we can specify join axes

In [112]:
pd.concat([s2, s5], axis=1, join_axes=[['a', 'c', 'b', 'e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

* To specify hierarchical index

In [113]:
pd.concat([s2,s2, s4])

a    0
b    1
a    0
b    1
f    5
g    6
dtype: int64

In [115]:
result = pd.concat([s2,s2, s4], keys = ['one', 'two', 'three'])

In [116]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [117]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

* Combining along the axis 1 keys will become data frame columns headers

In [123]:
pd.concat([s2, s3, s4], axis=1, keys=['one', 'two', 'three'])

C:\Users\davep\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [127]:
d18 = pd.DataFrame(np.arange(6).reshape(3,2), index = ['a', 'b','c'], columns=['one', 'two'])
d19 = pd.DataFrame(5 + np.arange(4).reshape(2,2), index=['a','c'], columns=['three', 'four'])

In [128]:
d18

   one  two
a    0    1
b    2    3
c    4    5

In [129]:
d19

   three  four
a      5     6
c      7     8

In [130]:
pd.concat([d18, d19], axis=1, keys=['level1', 'level2'])

C:\Users\davep\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

* Passing dict keys instead of a list, the dict's keys will be used for key's option

In [131]:
pd.concat({'level1':d18, 'level2':d19},axis=1)

C:\Users\davep\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

* To ignore row index

In [133]:
d20 = pd.DataFrame(np.random.randn(3,4), columns=['a', 'b', 'c', 'd'])
d21 = pd.DataFrame(np.random.randn(2,3), columns=['b','d', 'a'])

In [134]:
d20

          a         b         c         d
0  0.241451  1.308073 -0.171101  1.205850
1  0.967553 -1.082057  2.269726  0.391072
2  0.164915 -0.082656 -0.396084 -1.063332

In [135]:
d21

          b         d         a
0  0.501816 -1.277774  0.166828
1  0.450931 -1.425244  0.263597

In [136]:
pd.concat([d20,d21])

C:\Users\davep\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0  0.241451  1.308073 -0.171101  1.205850
1  0.967553 -1.082057  2.269726  0.391072
2  0.164915 -0.082656 -0.396084 -1.063332
0  0.166828  0.501816       NaN -1.277774
1  0.263597  0.450931       NaN -1.425244

In [137]:
pd.concat([d20,d21], ignore_index=True)

C:\Users\davep\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0  0.241451  1.308073 -0.171101  1.205850
1  0.967553 -1.082057  2.269726  0.391072
2  0.164915 -0.082656 -0.396084 -1.063332
3  0.166828  0.501816       NaN -1.277774
4  0.263597  0.450931       NaN -1.425244

#### Duplicate indices in concat

In [28]:
def make_df(col, index):
    return pd.DataFrame({c: [str(c) + str(i) for i in index] for c in col}, index)

In [29]:
my_df1 = make_df('ABC', [1,2,3])

In [30]:
my_df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [31]:
my_df2 = make_df('ABC', [4,5,6])

In [32]:
my_df2

    A   B   C
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6

In [33]:
pd.concat([my_df1, my_df2]) # repeated index in result

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6

* Make it as repeated index

In [34]:
my_df2.index = my_df1.index

In [35]:
my_df2

    A   B   C
1  A4  B4  C4
2  A5  B5  C5
3  A6  B6  C6

In [36]:
pd.concat([my_df1, my_df2])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5
3  A6  B6  C6

* To catch repeated index we can use `verify_integrity = True` flag.

In [38]:
try:
    pd.concat([my_df1, my_df2], verify_integrity=True)
except ValueError as e:
    print("ValueError", e)

ValueError Indexes have overlapping values: Int64Index([1, 2, 3], dtype='int64')

* Ignore index. Result will have its own new index

In [39]:
pd.concat([my_df1, my_df2], ignore_index=True)

    A   B   C
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3
3  A4  B4  C4
4  A5  B5  C5
5  A6  B6  C6

* Adding multiple index
* using `keys` option specify label for data sources

In [40]:
pd.concat([my_df1, my_df2], keys=['x', 'y'])

      A   B   C
x 1  A1  B1  C1
  2  A2  B2  C2
  3  A3  B3  C3
y 1  A4  B4  C4
  2  A5  B5  C5
  3  A6  B6  C6

In [41]:
my_df3 = make_df('ABC', [1,2])
my_df4 = make_df('BCD', [3,4])

In [42]:
my_df3

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

In [43]:
my_df4

    B   C   D
3  B3  C3  D3
4  B4  C4  D4

In [44]:
pd.concat([my_df3, my_df4]) # it does outer join by default

C:\Users\davep\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [45]:
pd.concat([my_df3, my_df4], join = 'inner')

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [46]:
pd.concat([my_df3, my_df4], join_axes=[my_df3.columns]) # specify column index

     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

#### `append`

In [47]:
my_df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [48]:
my_df2

    A   B   C
1  A4  B4  C4
2  A5  B5  C5
3  A6  B6  C6

In [49]:
my_df1.append(my_df2)

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5
3  A6  B6  C6

![concat_Argument](images/concat_Argument.jpg)

#### Globbing
* Glob function find files based on a pattern.
* Pattern matchinbg for file name.
* It return list of file names that match the pattern.

In [124]:
import glob

In [127]:
csv_files = glob.glob('data/*.csv')

In [128]:
csv_files

['data\\data.csv',
 'data\\ex1.csv',
 'data\\ex2.csv',
 'data\\ex3.csv',
 'data\\ex5.csv',
 'data\\ex6.csv',
 'data\\ex7.csv',
 'data\\ex8.csv',
 'data\\ex9.csv',
 'data\\movies.csv']

```
list_data = []
for filename in csv_files:
    data = pd.read_csv(filename)
    list_data.append(data)
pd.concat(list_data)

```

### Combining data with overlap

* We have 2 datasets whoes index overlap in full or part.

In [142]:
s6 = pd.Series([np.nan, 2.5, np.nan, 3.5,4.5,np.nan], index=['f','e','d','c','b','a'])

In [145]:
s7 = pd.Series(np.arange(len(s6)), dtype= np.float64, index=['f','e','d','c','b','a'])

In [147]:
s7[-1] = np.nan

In [148]:
s6

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [149]:
s7

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [150]:
np.where(pd.isnull(s6), s7, s6)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

#### `combine_first`
* Looks like patching missing data in calling object with data from object you pass.

In [152]:
s7[:-2].combine_first(s6[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [154]:
d22 = pd.DataFrame({'a': [1., np.nan, 5., np.nan], 'b': [np.nan, 2., np.nan, 6.], 'c': range(2, 18, 4)})

d23 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.], 'b': [np.nan, 3., 4., 6., 8.]})

In [155]:
d22

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [156]:
d23

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [157]:
d22.combine_first(d23)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [73]:
pop = pd.read_csv('https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv')
areas = pd.read_csv('https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv')
abbrevs = pd.read_csv('https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv')

In [71]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [74]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [75]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [78]:
merged = pd.merge(pop, abbrevs, how = 'outer', left_on='state/region', right_on='abbreviation')

In [79]:
merged.head()

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

In [82]:
merged = merged.drop('abbreviation', axis = 1)

In [85]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [86]:
merged.loc[merged['population'].isnull(), :]

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN
2453           PR  under18  1993         NaN   NaN
2454           PR  under18  1992         NaN   NaN
2455           PR    total  1992         NaN   NaN
2456           PR  under18  1994         NaN   NaN
2457           PR    total  1994         NaN   NaN
2458           PR    total  1995         NaN   NaN
2459           PR  under18  1995         NaN   NaN
2460           PR  under18  1996         NaN   NaN
2461           PR    total  1996         NaN   NaN
2462           PR  under18  1998         NaN   NaN
2463           PR    total  1998         NaN   NaN
2464           PR    total  1997         NaN   NaN
2465           PR  under18  1997         NaN   NaN
2466           PR    total  1999         NaN   NaN
2467           PR  under18  1999         NaN   NaN

* All PR are null before year 2000

In [89]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [91]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'

In [92]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [93]:
merged = pd.merge(merged, areas, on='state', how = 'left')

In [94]:
merged.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [95]:
merged.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [97]:
merged.loc[merged['area (sq. mi)'].isnull(), 'state'].unique()

array(['United States'], dtype=object)

In [98]:
merged.dropna(inplace=True)

In [99]:
data2010 = merged.query("year == 2010 & ages == 'total'")

In [100]:
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [101]:
data2010.set_index('state', inplace=True)

In [102]:
density = data2010['population'] / data2010['area (sq. mi)']

In [103]:
density.sort_values(ascending=False, inplace=True)

In [104]:
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [105]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

### `merge_ordered()`

In [7]:
austin = pd.DataFrame({'date':['2016-01-01','2016-02-08','2016-01-17'],
                       'ratings':['Cloudy','Cloudy','Sunny']})

houston = pd.DataFrame({'date':['2016-01-04','2016-01-01','2016-03-01'], 
                        'ratings':['Rainy','Cloudy','Sunny']})

In [8]:
austin

         date ratings
0  2016-01-01  Cloudy
1  2016-02-08  Cloudy
2  2016-01-17   Sunny

In [9]:
houston

         date ratings
0  2016-01-04   Rainy
1  2016-01-01  Cloudy
2  2016-03-01   Sunny

In [10]:
pd.merge_ordered(austin, houston)

         date ratings
0  2016-01-01  Cloudy
1  2016-01-04   Rainy
2  2016-01-17   Sunny
3  2016-02-08  Cloudy
4  2016-03-01   Sunny

In [12]:
pd.merge_ordered(austin, houston, on='date', suffixes=['_aus', '_hos'])

         date ratings_aus ratings_hos
0  2016-01-01      Cloudy      Cloudy
1  2016-01-04         NaN       Rainy
2  2016-01-17       Sunny         NaN
3  2016-02-08      Cloudy         NaN
4  2016-03-01         NaN       Sunny

In [13]:
pd.merge_ordered(austin, houston, on='date', suffixes=['_aus', '_hus'], fill_method='ffill')

         date ratings_aus ratings_hus
0  2016-01-01      Cloudy      Cloudy
1  2016-01-04      Cloudy       Rainy
2  2016-01-17       Sunny       Rainy
3  2016-02-08      Cloudy       Rainy
4  2016-03-01      Cloudy       Sunny

### `merge_asof()`

# Reshaping

* stack: Rotate/pivot from the columns in the data to rows
* unstack: Pivots from the row to columns

In [158]:
d23 = pd.DataFrame(np.arange(6).reshape((2,3)), index = pd.Index(['Ohio', 'Colarado'], name = 'state'), 
                   columns=pd.Index(['one','two','three'], name = 'number'))

In [159]:
d23

number    one  two  three
state
Ohio        0    1      2
Colarado    3    4      5

In [162]:
result = d23.stack()

In [163]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colarado  one       3
          two       4
          three     5
dtype: int32

In [164]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colarado    3    4      5

* By default innermost level will be unstacked.

In [166]:
result.unstack(0) # passing level number

state   Ohio  Colarado
number
one        0         3
two        1         4
three      2         5

In [167]:
result.unstack('state') # passing level name

state   Ohio  Colarado
number
one        0         3
two        1         4
three      2         5

In [169]:
s8 = pd.Series([0,1,2,3] ,index=['a','b','c','d',])
s9 = pd.Series([4,5,6] ,index=['c','d','e'])
s10 = pd.concat([s8, s9], keys=['one', 'two'])

In [170]:
s8

a    0
b    1
c    2
d    3
dtype: int64

In [171]:
s9

c    4
d    5
e    6
dtype: int64

In [172]:
s10

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [173]:
s10.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

* Stack filter out missing data

In [174]:
s10.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [175]:
s10.unstack().stack(dropna = False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

### Pivoting Wide to Long `pd.melt`
* Melting is a process of turning columns of data as rows.
* Merges multiple column into one, Producing the dataframe that is longer than an input.
* `id_vars` : columns you want to hold constant
* `value_vars` : which column want to melt

In [106]:
my_df = pd.DataFrame({'key':['foo', 'bar', 'baz'], 'A':[1,2,3], 'B':[4,5,6], 'C':[7,8,9]})

In [107]:
my_df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

* key column can be group indicator and other columns are data values. Mention which column is group indicator

In [108]:
pd.melt(my_df, ['key'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [119]:
ans = pd.melt(my_df, id_vars=['key'], value_vars=['A', 'B'])

In [120]:
ans

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [110]:
pd.melt(my_df, value_vars=['A', 'B', 'C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [118]:
pd.melt(my_df)

   variable value
0       key   foo
1       key   bar
2       key   baz
3         A     1
4         A     2
5         A     3
6         B     4
7         B     5
8         B     6
9         C     7
10        C     8
11        C     9

* Specifying `value_name` parameter will rename `value` column
* Passing `col_level=0` as parameter will yield key-value pair of melted variab

### Pivoting Long to Wide `pd.pivot`
* We prefer to have one column per distince item value.

In [121]:
ans

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [122]:
ans.pivot(index='key', columns='variable', values='value')

variable  A  B
key
bar       2  5
baz       3  6
foo       1  4

In [123]:
ans.pivot('key', 'variable') # ommiting values parameter return hierarchical indexing

         value
variable     A  B
key
bar          2  5
baz          3  6
foo          1  4